# StopOnError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FBXExportOptions..::..StopOnError Property
FBXExportOptions Class See Also
---
Whether export process should stop when a view fails to export.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool StopOnError { get; set; }
```

Visual Basic
---
```text
Public Property StopOnError As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool StopOnError {
	bool get ();
	void set (bool value);
}
```

# Remarks
If set to false, the export would continue until all views are processed. This option has an effect only when a set of more than one view is specified.
# See Also
FBXExportOptions Class
Autodesk.Revit.DB Namespace